structure = """
Молодёжное самоуправление состоит из 3 направлений, за каждое из которых отвечают заместители:

1. Направление по культурно-массовым мероприятиям
2. Информационное направление.
3. Направление по корпоративной культуре.

Чтобы узнать подробнее о каком-либо направлении, нажми соответствующую кнопку😌
"""
leaders = (
    """
@id103015969(Вера Козьмина)
Председатель Молодёжного самоуправления
    """,
    """
@id157367997(Егор Балашов)
Первый заместитель председателя Молодёжного самоуправления
    """,
    """
@vjgrvbnapnne(Максим Сергеев)
Второй заместитель председателя Молодёжного самоуправления 
    """,
    """
@sinteponn(Таня Митинская)
Заместитель председателя по культурно-массовым мероприятиям
    """,
    """
@fhdidghf(Олесе Криворчук)
Заместитель председателя по информационному направлению
    """,
    """
@id282837678(Таня Шубина)
Заместитель председателя по корпоративной культуре
    """,
    """
@id139115497(Арина Мальцева)
Наш атташе
    """
)
kmm = """
В этом направлении ты сможешь:

⭐ пообщаться с креативными, талантливыми и интересными людьми;
⭐ раскрыть в себе творческие и организаторские способности;
⭐ попробовать себя в роли руководителя;
⭐ придумывать массовые мероприятия и реализовывать их;
⭐ завести новые интересные и полезные знакомства.

Интересно?😏
Пиши @sinteponn(Тане) и она все тебе подробно расскажет 🤗
"""
inf = """
В этом направлении ты сможешь:

💾 пообщаться с креативными, талантливыми и интересными людьми;
💾 реализовать все свои задумки;
💾 попробовать себя в роли руководителя, дизайнера, оформителя;
💾 научиться вести социальные сети;
💾 придумывать классные мероприятия и реализовывать их;
💾 завести новые интересные и полезные знакомства.

Интересно?😏
Пиши @fhdidghf(Олесе) и она все тебе подробно расскажет 🤗
"""
corp = """
В этом направлении ты сможешь:

🧩 пообщаться с креативными, талантливыми и интересными людьми;
🧩 реализовать все свои задумки;
🧩 попробовать себя в роли руководителя, дизайнера и оформителя;
🧩 придумывать классные мероприятия на развитие личностных и командных качеств и реализовывать их;
🧩 завести новые интересные и полезные знакомства.

Интересно?😏
Пиши @id282837678(Тане) и она все тебе подробно расскажет 🤗
"""


def ya_u_m(sex):
    sex = 'а' if sex == 1 else ''
    return f"""
💬Ярмарка учебных мест - это местный проект @bibliotekabrodskogo(Коношской библиотеки им. И. Бродского) и молодежного самоуправления, направленный на помощь старшеклассникам в профориентации.

📑Мы также делимся с вами информацией о правилах подачи документов для поступления, перечнем учебных заведений и пр.

📌Где находится ярмарка? - Ярмарка проходит в дистанционном режиме, по ссылке: https://vk.cc/bVZtuJ

Посмотрел{sex}, но остались вопросы? Задай их прямо здесь и сейчас‼️
"""


enter_ms = """
Если ты хочешь стать членом молодежного самоуправления, то выбери направление, которое тебе ближе
"""
